In [7]:
import pandas as pd
data={'category':['A','B','A','B','A','C','C'],
      'Values':[10,20,15,25,10,30,35]}
df=pd.DataFrame(data)
grouped=df.groupby('category')['Values'].sum()
print(grouped)

category
A    35
B    45
C    65
Name: Values, dtype: int64

In [9]:
# Apply Multiple Aggregations
grouped=df.groupby('category')['Values'].agg(['sum','mean','count'])
print(grouped)

          sum       mean  count
category
A          35  11.666667      3
B          45  22.500000      2
C          65  32.500000      2

In [15]:
# Groupby Multiple columns
data={'category':['A','A','B','B'],
      'subcate':['X','Y','X','Y'],
      'values':[10,20,30,40]}
df=pd.DataFrame(data)
grouped=df.groupby(['category','subcate'])['values'].sum()
print(grouped)

category  subcate
A         X          10
          Y          20
B         X          30
          Y          40
Name: values, dtype: int64

In [19]:
# Custom AGgregation functions
def custom_agg(x):
    return x.max()-x.min()
grouped=df.groupby('category')['values'].agg(custom_agg)
print(grouped)

category
A    10
B    10
Name: values, dtype: int64

In [25]:
# Reset-index
import pandas as pd
data={'category':['A','B','A','B','A','C','C'],
      'Values':[10,20,15,25,10,30,35]}
df=pd.DataFrame(data)
grouped=df.groupby('category')['Values'].sum()
# convert grouped result back to a DataFrame
result=grouped.reset_index()
print(result)

  category  Values
0        A      35
1        B      45
2        C      65

In [59]:
import pandas as pd
import pymysql
db_name="employee"
db_host="localhost"
db_username="root"
db_password="tejaMS123@"
conn=pymysql.connect(host=db_host,
                     user="root",
                     password="tejaMS123@",
                     db=db_name)
query="select * from emp"
df=pd.read_sql(query,conn)
conn.close()
print(df)
#df.groupby('job')['sal'].sum()
#df.groupby(['deptno','job'])['sal'].sum()
#df.groupby(['ename','job'])['sal'].sum()
df.groupby(['deptno','job'])['sal'].agg(['sum','mean','count'])

    empno   ename        job     mgr    hiredate      sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17   5000.0     NaN    10.0
1    7698   BLAKE    MANAGER  7839.0  1981-05-01   2850.0     NaN    30.0
2    7782   CLARK    MANAGER  7839.0  1981-06-09   2450.0     NaN    10.0
3    7566   JONES    MANAGER  7839.0  1981-04-02   2975.0     NaN    20.0
4    7788   Scott    ANALYST  7566.0  1987-07-13   3000.0     NaN    20.0
5    7902    FORD    ANALYST  7566.0  1981-12-03   3000.0     NaN    20.0
6    7369   SMITH      CLERK  7902.0  1980-12-17   3000.0     NaN    20.0
7    7499   ALLEN   SALESMAN  7698.0  1981-02-20   1600.0   300.0    30.0
8    7521    WARD   SALESMAN  7698.0  1981-02-22   1250.0   500.0    30.0
9    7654  MARTIN   SALESMAN  7698.0  1981-09-28   1250.0  1400.0    30.0
10   7844  TURNER   SALESMAN  7698.0  1981-09-08   1500.0     0.0    30.0
11   7876   ADAMS      CLERK  7788.0  1987-07-13   1100.0     NaN    20.0
12   7900   JAMES      CLERK  7698.0  1981-12-03    950.0     NaN    30.0
13   7934  MILLER      CLERK  7782.0  1982-01-23   1300.0     NaN    10.0
14   7777   tuski       None     NaN  1991-02-14      NaN     NaN     NaN
15   8888     eef       None     NaN  1991-12-12      NaN     NaN     NaN
16   3385    ewfe       None     NaN  1991-12-17      NaN     NaN     NaN
17   9090   SURYA       None     NaN  1990-12-12      NaN     NaN     NaN
18   3384   KRISH   SALESMAN  7783.0  1999-10-12   5000.0     0.0    10.0
19   9999  SURESH      CLERK  7785.0  1999-12-19   1200.0     0.0    20.0
20   3507     RAM    ANALYST  8768.0  1998-10-16  20000.0     0.0    80.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_4376\3546104411.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(query,conn)

                      sum          mean  count
deptno job
10.0   CLERK       1300.0   1300.000000      1
       MANAGER     2450.0   2450.000000      1
       PRESIDENT   5000.0   5000.000000      1
       SALESMAN    5000.0   5000.000000      1
20.0   ANALYST     6000.0   3000.000000      2
       CLERK       5300.0   1766.666667      3
       MANAGER     2975.0   2975.000000      1
30.0   CLERK        950.0    950.000000      1
       MANAGER     2850.0   2850.000000      1
       SALESMAN    5600.0   1400.000000      4
80.0   ANALYST    20000.0  20000.000000      1